{"config": {"layers": [{"config": {"batch_input_shape": [null, 1], "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 16, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "units": 2, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_2", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "softmax"}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow"}