{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "name": "dense_1", "units": 54, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "batch_input_shape": [null, 54], "trainable": true, "use_bias": true, "kernel_regularizer": null, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "name": "dense_2", "units": 64, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "batch_input_shape": [null, 26], "trainable": true, "use_bias": true, "kernel_regularizer": null, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "name": "dense_3", "units": 128, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "batch_input_shape": [null, 13], "trainable": true, "use_bias": true, "kernel_regularizer": null, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"activation": "softmax", "activity_regularizer": null, "bias_constraint": null, "name": "dense_4", "units": 2, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential"}