{"class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "batch_input_shape": [null, 1], "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "use_bias": true, "activity_regularizer": null, "activation": "linear", "units": 4096, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "name": "dense_2", "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "activity_regularizer": null, "activation": "softmax", "bias_constraint": null, "bias_regularizer": null}}]}}